
class Variable:
    """
    配置购票初始化信息
    """
    seat = {
            # 高铁
            '商务座': 32,
            '一等座': 31,
            '二等座': 30,
            '特等座': 25,

            # 其他
            '高级软卧': 21,
            '软卧': 23,
            '硬卧': 28,
            '硬座': 29,
            '无座': 26,
            '动卧': 33,
            }
    # 座位类型对应id
    zuoweiID = {
            '商务座': '9',
            '一等座': 'M',
            '二等座': 'O',

            '硬卧': '3',
            '硬座': '1',
            '软卧': '4'
            }

    # 1-12月英文缩写
    yuefen = {
            '01': 'Jan',
            '02': 'Feb',
            '03': 'Mar',
            '04': 'Apr',
            '05': 'May',
            '06': 'Jun',
            '07': 'Jul',
            '08': 'Aug',
            '09': 'Sept',
            '10': 'Oct',
            '11': 'Nov',
            '12': 'Dec',
            }
    # # 周1-周日英文缩写
    xingqi = {
            '1': 'Mon',
            '2': 'Tues',
            '3': 'Wed',
            '4': 'Thur',
            '5': 'Fri',
            '6': 'Sat',
            '7': 'Sun',
            }

    # 购票信息配置【必须】
    cfc = "北京"              # 出发地       ——必须参数
    ddc = "南京"              # 目的地       ——必须参数
    date = "2022-12-21"       # 出发日期       ——必须参数
    time = "20:50"            # 出发时间(必须修改）       ——必须参数
    ctype = "高铁"             # 车次类型       ——必须参数
    zwtype = "二等座"          # 座位类型（设置为空时默认有票就抢购）       ——必须参数

    play_zuowei_id = zuoweiID[zwtype]